tap "drone/drone"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "harfbuzz"
brew "apktool"
brew "btop"
brew "python@3.11"
brew "cmatrix"
brew "dialog"
brew "dockutil"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "gobject-introspection"
brew "guile"
brew "gum"
brew "jasper"
brew "shared-mime-info"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "jadx"
brew "lorem"
brew "mas"
brew "media-info"
brew "s-lang"
brew "midnight-commander"
brew "mitmproxy"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "pandoc"
brew "ranger"
brew "ruby"
brew "scrcpy"
brew "starship"
brew "sysbench"
brew "tldr"
brew "vbindiff"
brew "wget"
brew "youtube-dl"
brew "drone/drone/drone"
brew "teamookla/speedtest/speedtest"
cask "android-platform-tools"
cask "gitx"
cask "iterm2"
cask "jellyfin"
cask "kitty"
cask "logi-options-plus"
cask "nordvpn"
cask "nvalt"
cask "onedrive"
cask "openemu"
cask "opera-gx"
cask "sixtyforce"
cask "spotmenu"
cask "sweet-home3d"
cask "ticktick"
cask "transmission"
cask "ukelele"
cask "utm"
cask "virtualbox"
