# cli
brew "mas"
brew "nvm"
brew "fish"
brew "dialog"
brew "scrcpy"
brew "wget"
brew "tldr"
brew "ffmpeg"
brew "youtube-dl"
brew "speedtest"
brew "midnight-commander"
brew "ranger"
brew "btop"
brew "neofetch"
cask "kitty"

# developer tools
brew "git"
brew "gh"
cask "github"
cask "gitkraken"
cask "atom"
cask "android-studio"
cask "jadx"
cask "charles"
cask "nordlayer"
cask "nordvpn"
cask "tunnelblick"

# browser
cask "google-chrome"

# security
brew "1Password"

# messaging
cask "messenger"
cask "whatsapp"
cask "slack"
cask "discord"
cask "zoom"
cask "skype"

# media
cask "spotify"
cask "vls"
cask "gimp"
cask "audacity"
mas "iMovie", id: 408981434

# utilities
cask "logi-options-plus"
cask "balenaetcher"
cask "ukelele"
cask "appcleaner"
cask "android-file-transfer"
cask "the-unarchiver"
cask "sweet-home3d"
cask "utm"
mas "Magnet", id: 441258766
mas "Amphetamine", id: 937984704
